app/controllers/candies_controller.rb

    def index
        @candies = Candy.all
---
SELECT "candies".* FROM "candies"

    def show
        @candy = Candy.find(params[:id])
---
SELECT "candies".* FROM "candies" WHERE "candies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        #render plain: params[:candy].inspect
        @candy = Candy.new(candy_params)
        @candy.save
---
INSERT INTO "candies" ("name", "calories", "wrapper_color", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Test Candy"], ["calories", 100], ["wrapper_color", "blue"], ["created_at", "2020-10-30 12:55:38.161641"], ["updated_at", "2020-10-30 12:55:38.161641"]]